Парадигмы программирования
Императивное - машинный язык, поселовательность операций, циклы условия, но без функций
Процедурный - структурнрое программирование, использование процедур и функций
Функциональное - финкции становятся элементами первого рода и могут быть поданы в другие функции
Объектно-ориентированное (ООП) - 
Инкапсуляция - объединение данных и методов для работы с ними в рамках работы с объектами, возможно с ограничением доступа 
Наследование - создание нового типа данных на основе существующих, с полным или частичным заимствованием функционала
Полиморфизм - один интерфейс, но много реализаций
Абстракция - выделение опсновных признаков объекта реального мира
Шаблоны используют полиморфизм
Класс - это описание некоторого концепта (идеи) из интересующей предметной области в виде набора полей и методов
public - любой внешний по отношению к классу код имеет доступ к полям и методам
private - доступ имеют только поля и методы самого класса или его дружественные классы
static - принадлежит классу, начинает жить с начала описания класса (а не объекта) и живет до конца работы программы
this - 
поля privat с нижним подчеркиванием -
